// 심볼릭 상수: 메모리 공간을 가지고 있는 상수입니다.
// 리터럴 상수: 메모리 공간을 가지고 있지 않은 상수입니다.
// AND: 2개의 비트가 모두 1일 때 1을 반환  ----- a&b
// OR: 2개의 비트가 하나라도 1일 때 1을 반환 ----- a|b
// XOR: 2개의 비트가 서로 같을 때 0을 반환/ 2개의 비트가 서로 다를 때 1을 반환 ----- a^b
// NOT: 비트를 반전함(0일 때 1을, 1일 때 0을 반환) ----- ~a (2개를 비교하는게 아니라 하나만 함)

// 논리 연산자
/*
	// 두 개의 논리 값을 연산하여 참 또는 거짓을 결과로 얻는 연산자입니다.

	// AND (&&)        두 개의 조건이 참이라면 1
	// OR (||)        두 개 중 하나라도 참이라면 1

	// NOT (!)        조건문이 거짓이라면 1
	// bool 변수 = false; 변수가 거짓일 때 참
	//    변수 = !변수;

	int x = 10;
	int y = 20;

	if (x == 10 && y == 20)
	{
		printf("논리 연산 AND의 조건이 성립합니다.\n");
	}

	if (x == 10 || y > 30)
	{
		printf("논리 연산 OR의 조건이 성립합니다.\n");
	}

	if (!(x > 10))
	{
		printf("논리 연산 NOT의 조건이 성립합니다.\n");
	}

*/

