// 자료형에 대해
	/*
	// 자료형: 데이터를 저장하기 위해 데이터의 형태를 정해주는 것
	// (문자) char: 1바이트 크기, 하나의 문자 저장 가능
	// (정수) short: 2바이트 크기, 정수 저장 가능
	// (정수) int: 4바이트 크기, 정수 저장 가능
	// (정수) long: 운영체제에 따라 4바이트 또는 8바이트 크기, 정수 저장 가능
	// long long: 8바이트 또는 그 이상의 크기를 가짐
	// (실수) float: 4바이트 크기, 실수 저장 가능
	// (실수) double: 8바이트 크기, 실수 저장 가능
	// 서식지정자: 출력하기 위한 자료형의 정보를 명시적으로 지정해주는 것
	// 변수의 예시 형태 int a = 1; <- a가 변수
	// 심볼릭 상수: 메모리 공간을 가지고 있는 상수입니다. 예시) const int b = 2; <- 'const'가 붙은 변수를 변하지 않는 심볼릭 상수가 됨
	// 리터럴 상수: 메모리 공간을 가지고 있지 않은 상수입니다. 예시) 그냥 숫자라고 생각하면 됨
	// 비트(bit): 데이터를 나타내는 최소의 단위로, 0 또는 1의 값만 저장이 가능함
	// 바이트: 1바이트 = 8비트, 한 문자를 나타내기 위한 최소한의 단위
	// 10진수를 2진수로 변환하는 과정: 10진수를 1이 될 때까지 계속 2로 나누어 준 다음 나눈 위치의 나머지 값을 아래에서 위로 순서대로 정렬함
	// 비트 연산자: 비트 단위로 논리 연산을 수행하기 위해 사용하는 연산자
	// 자료형 사진 - https://s3-ap-northeast-2.amazonaws.com/opentutorials-user-file/module/3921/9904.png
	//https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fk.kakaocdn.net%2Fdn%2FoJvWv%2FbtqLcUmnNTJ%2Fy6QnSOk0aem6OAJ8YQdKg0%2Fimg.png
	*/